[
  "What is the exact import path and export name for the ES module in the documentation? Should `registerExecuteRecipe` be a named export or default export, and how should consumers import it?",
  "Can you provide a sample of the recipe DSL JSON that corresponds to the execute_recipe node (including the exact property names), so we can illustrate in docs how the node maps to a recipe step?",
  "Please confirm the exact shape of `node.data.config`: are the properties strictly `recipe_path` and `context_overrides`, or do they need to match different field names for serialization?",
  "How should JSON parse errors in the `context_overrides` textarea be surfaced to the user? Is `console.warn` sufficient, or do you want a visible UI validation error message or inline error indicator?",
  "Are there any default values or placeholder text we should display in the recipe path input or the context overrides textarea for better UX?",
  "For `context_overrides`, do we prefer a raw JSON textarea only, or should we support a key/value repeater UI? If both are options, which should be the primary example in the docs?",
  "Beyond wrapping the form in `<div class=\"node\">`, are there any additional CSS class conventions or style guidelines we need to follow to maintain consistency with other Drawflow nodes?",
  "Which Drawflow lifecycle hooks should be documented and implemented? You mention `onCreate` and `onUpdate` — should we also support `onSelect`, `onDelete`, or any other events?",
  "Should we define any debug or info log messages (e.g. when a node is created, updated, or serialized), or is logging limited to the JSON parse error warning?",
  "Does the `context_overrides` JSON have any schema requirements or restrictions (such as string-only values), or should we accept any valid JSON object?",
  "How is the new node type integrated into the STEP_REGISTRY? Do we need to manually add an entry, or is it automatically discovered when serialized via `drawflowToRecipe`?",
  "Should the documentation include guidance on how and when to call `registerExecuteRecipe(editor)` in the application initialization sequence?",
  "Do we need to document and provide examples of how to export the final Drawflow canvas data into a recipe JSON file for downstream execution?",
  "Are there any performance or UX considerations for handling large `context_overrides` payloads (for example, debouncing JSON parsing on input events)?",
  "Will there be any automated tests or test harnesses for this node? If so, what should we document about test setup and expected behaviors?"
]