[
  "What HTML structure and attribute conventions should be used to define the Drawflow connectors for the conditional node? For example, how should the input port, the 'true' output, and the 'false' output be marked up in the template, and should they include specific class names or data-attributes?",
  "In the node data model, what exactly should `config.if_true` and `config.if_false` contain? Are they expected to store connector IDs, target node IDs, boolean flags, or something else, and what type should they be (string, number, array)?",
  "What default values should be assigned to `node.data.config.condition`, `config.if_true`, and `config.if_false` when a new conditional node is created? Should the condition default to an empty string or a placeholder expression?",
  "How should the CSS for the node be provided? Should styling be included inline within the HTML template string in `src/nodes/conditional.js`, or should there be a separate CSS file? If separate, what path and naming conventions should be followed?",
  "Which serialization module APIs need to be invoked (and where) to ensure that `config.condition`, `config.if_true`, and `config.if_false` are correctly preserved and restored during `editor.export()` and import? Please specify method names and invocation points if known.",
  "How should error conditions like `MissingInputElement` and `BindingFailure` be surfaced? Should the implementation throw JavaScript errors, log console warnings, display UI notifications, or a combination? And should the spec include exact error codes or exception classes?",
  "Should the module include any log statements (e.g., info-level logs about node registration)? If so, what messages and log levels are required, and should they use a particular logging utility or global logger?",
  "For the documentation file, what usage examples should be included? e.g., code snippets showing how to import `registerConditional`, initialize it on an editor instance, configure the node in the UI, connect branches, and perform JSON export/import.",
  "Is there a minimum or specific version constraint for the Drawflow library that should be stated in the docs? Should compatibility notes be provided for older or newer versions?",
  "Does the specification require support for live updates to the condition (e.g., re-evaluating or re-rendering when the input changes), and if so, should an `onUpdate` or similar hook be implemented alongside `onCreate`?",
  "Should the module export or provide TypeScript type definitions or JSDoc typings for `node.data.config` and `registerConditional`? If so, what shape and names should those types have?",
  "Are there any accessibility requirements for the HTML UI (for example, ARIA labels on the `<input df-condition>`), keyboard navigation expectations, or internationalization concerns that need to be addressed?",
  "Should the documentation specify any testing requirements, such as unit or integration tests? If yes, what frameworks or patterns should be used, and which scenarios must be covered?",
  "Does the project use any HTML templating helpers or conventions (e.g., tagged template literals) for node templates, or is plain string HTML required? If there are conventions, what are they?",
  "Are there any project-wide naming conventions or attribute prefixes (beyond `df-condition`) that must be applied in the node's HTML and JS? If so, please provide details."
]