[
  "Can you provide the exact HTML structure (wrapper elements, container CSS classes or IDs) for the node UI and show how the four fields (context key, value textarea, nested_render checkbox, and if_exists dropdown) should be laid out within that structure?",
  "What precise df-* attribute conventions or helper functions should be used to bind each input/textarea/select field to node.data.config? Is there an existing binding utility we import, or do we implement custom listeners?",
  "What should the default shape and type of node.data.config be when a new node is created? Please enumerate default values for the properties (e.g., key: '', value: '', nested_render: false, if_exists: 'overwrite').",
  "When and how should we attempt to JSON-parse the value textarea? Should parsing run on every keystroke, only when nested_render is true, or at save/export time? What JSON parsing strategy or library should we use?",
  "In the case of a JSONParseError, what specific Error class should we throw or import, and how should the UI allow the user to choose between correcting the JSON or treating the input as a raw string? Please describe the interaction flow and required UI elements.",
  "How exactly do we hook into Drawflow’s registration callbacks? What is the signature of editor.registerNode for onCreate, onUpdate, and how do we clean up event listeners when a node is removed?",
  "For CSS scoping and placement, should styling live inside set_context.js (e.g., injected <style> tags) or in a separate stylesheet? Do we have naming conventions or existing classes to extend within the Drawflow theme?",
  "For debug logging, should we use console.debug or an application logger? If a logger utility is required, what is its import path, and how should log messages be formatted (e.g., include node ID, field name, new value)?",
  "When a ValidationError occurs because the context key is empty, which Drawflow API or DOM approach should we use to disable node editing? Should we disable all inputs, apply a CSS \"disabled\" state to the box, or call an editor.lockNode method?",
  "Besides the form fields, does the node need a header or title label (for example, “Set Context”) or an icon? If so, please specify the text, styling, and placement within the node’s HTML.",
  "For the merge strategy dropdown, should the stored config.if_exists value exactly match the option labels \"overwrite\" and \"merge\", or should we map them to constants or booleans?",
  "In the documentation file, what import path or initialization code should we show for developers to include the Set Context node in their Drawflow editor setup?"
]